STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/math/app_math.c
/**
  ******************************************************************************
  * @file    app_math.c
  * @author  MCD Application Team
  * @brief   Math application implementation.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
#ifndef __APP_MATH_C
#define __APP_MATH_C

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx.h"

#include <string.h>
#include <stdio.h>
#include <arm_math.h>
#include "stm32g474e_eval.h"
#include "stm32g474e_eval_lcd.h"
#include "utils.h"
#include "app_math.h"
#include "k_config.h"
#include "k_module.h"
#include "k_menu.h"
#include "stm32g4xx_ll_cordic.h"

/* Private typedef ----------------------------------------------------------*/
extern tMenuItem psCurrentMenuItem;

/* Private constants ----------------------------------------------------------*/
enum {
  CORDIC_INIT,
  CORDIC_SELECT_FUNCTION,
  CORDIC_WAIT_EVENT,
  CORDIC_EXIT,
  CORDIC_END
};

enum {
  FMAC_INIT,
  FMAC_SELECT_FUNCTION,
  FMAC_WAIT_EVENT,
  FMAC_EXIT,
  FMAC_END
};

/* Function list table dimensions */
#define CORDIC_MAX_FUNCTIONS          3U
#define FMAC_MAX_FUNCTIONS            2U
#define CORDIC_MAX_FUNCTION_NAME_LENGHT     18U
#define FMAC_MAX_FUNCTION_NAME_LENGHT       12U

/* User messages */
#define MSG_TITLE_SELECTION "UP/DOWN: Select - RIGHT: Quit"

/* CORDIC */
#define CORDIC_BLOCKSIZE            100U

/* FMAC */
#define FMAC_BLOCKSIZE              220U
#define FMAC_NUM_TAPS_FIR            52U /* FIR 51: Num Taps FIR must be even for arm_math.h */
#define FMAC_NUM_STAGES_BIQUAD        4U /* IIR 8: Number of 2nd order stages, overall order is 2*numStages */
#define FMAC_STATE_SIZE_FIR     (FMAC_BLOCKSIZE + FMAC_NUM_TAPS_FIR)
#define FMAC_STATE_SIZE_BIQUAD  (4 * FMAC_NUM_STAGES_BIQUAD)
#define FMAC_STATE_SIZE         ((FMAC_STATE_SIZE_FIR>FMAC_STATE_SIZE_BIQUAD)?FMAC_STATE_SIZE_FIR:FMAC_STATE_SIZE_BIQUAD)
#define FMAC_FREQ_SAMPLING       500000U /* 500 KHz */
#define FMAC_FREQ_SAMPLING_KHZ  (FMAC_FREQ_SAMPLING / 1000)

/* common */
#define MATH_DISPLAY_CYCLES           1U
#define MATH_DISPLAY_CPULOAD          2U

/* Private function prototypes -----------------------------------------------*/
KMODULE_RETURN _MathDemoExec(void);
KMODULE_RETURN _MathConfig(void);
KMODULE_RETURN _MathExit(void);

void MathMenuUserAction(uint8_t sel);
void MathUserHeader(void);

static void Math_CORDIC(void);
static void Math_FMAC(void);
static void Math_DisplayTitle(char * Title);
static void Math_DisplayBottomMessage(char * msg);
static void Math_DisplayWindow(void);
static void Math_ClearWindow(void);
static void Cordic_DisplayList(uint8_t Select);
static void Fmac_DisplayList(uint8_t Select);
static void Cordic_DisplayFunction(uint8_t Select);
static void Fmac_DisplayFunction(uint8_t Select);
static void Math_DisplaySignal32b(int32_t *Buffer, uint32_t BufferSize, uint32_t Color);
static void Math_DisplaySignal16b(int16_t *Buffer, uint32_t BufferSize, uint32_t Color);
static void Cordic_DisplayInfo(char * SWLibName, uint32_t PeriphTime, uint32_t SWLibTime, uint32_t DisplayStyle);
static void Fmac_DisplayInfo(char * SWLibName, uint32_t SWLibCpuLoad);

extern void Error_Handler(void);


/* Private Variable ----------------------------------------------------------*/

/* Main Menu */
const tMenuItem MathMenuItems[] =
{
  {"CORDIC (Trigo)"     , 14, 30, SEL_EXEC, MODULE_MATH, Math_CORDIC, MathMenuUserAction, NULL, NULL, NULL  },
  {"FMAC (Filtering)"   , 14, 30, SEL_EXEC, MODULE_MATH, Math_FMAC  , MathMenuUserAction, NULL, NULL, NULL  },
  {"Return"             , 14, 30, SEL_EXIT, MODULE_MATH, NULL       , NULL              , NULL, NULL, NULL  },
};


const tMenu MathMenu = {"Math", MathMenuItems, countof(MathMenuItems), TYPE_TEXT, 1, 1 };

const char CordicFunctionList[CORDIC_MAX_FUNCTIONS][CORDIC_MAX_FUNCTION_NAME_LENGHT] =
                              {"SIN+COS (Polling)", "SIN+COS (DMA)", "SQRT (Polling)"};
const char FmacFunctionList[FMAC_MAX_FUNCTIONS][FMAC_MAX_FUNCTION_NAME_LENGHT] =
                              {"FIR 51", "IIR 8"};

/* Used to exit application */
static __IO uint8_t UserEvent = 0;
static __IO uint8_t UserAction = 0;
static __IO uint16_t Keypressed = FALSE;

/* Variable for FMAC notification */
uint32_t FmacOutputDataReady;

/* Coefficients to run FIR 51:
   For FMAC, 51 coefficients are needed
   For arm_math.h lib, a 52th coefficient is required (0) to reach even number
   of coefficients */
const q15_t fir51_Coeffs[FMAC_NUM_TAPS_FIR] = {
  -30,-89,-81,120,447,569,251,-215,-252,200,455,11,-554,
  -292,572,680,-403,-1122,-34,1566,897,-1946,-2697,2202,10159,14092,10159,2202,
  -2697,-1946,897,1566,-34,-1122,-403,680,572,-292,-554,11,455,200,-252,-215,251,
  569,447,120,-81,-89,-30,0};

/* Coefficients to run IIR 8:
   For FMAC, 9+8 coefficients are needed for IIR 8
   For arm_math.h lib, biquad cascade direct form 1 is used as no IIR available,
   and 6*FMAC_NUM_STAGES_BIQUAD are required */
const q15_t iir8_Coeffs[17] = {
  46,367,1286,2571,3214,2571,1286,367,46,
  16851,-22722,18748,-10971,4325,-1143,179,-13};

const q15_t biquad_Coeffs[6*FMAC_NUM_STAGES_BIQUAD] = {
  16384, 0, 32767,  16384,   8596,   -22180,
  16384, 0, 32767,  16384,   6620,   -9548,
  16384, 0, 32767,  16384,   5629,   -3216,
  16384, 0, 32767,  16384,   5208,   -521};

/* FMAC Input signal: Sine 1KHz + Sine 21 KHz */
const int16_t SIN_1_21KHZ[FMAC_BLOCKSIZE]={
  0,7988,-6977,20337,-7782,23856,0,18307,13479,8426,26040,1053,31130,1050,26042,8420,13481,
  18299,0,23851,-7786,20334,-6985,7988,-10,-7988,6969,-20339,7777,-23862,0,-18314,-13476,
  -8432,-26037,-1055,-31130,-1048,-26044,-8413,-13484,-18292,0,-23845,7790,-20331,6993,
  -7987,20,7989,-6960,20342,-7773,23868,0,18322,13474,8439,26035,1058,31130,1045,26046,
  8407,13486,18284,0,23839,-7794,20329,-7001,7987,-29,-7989,6952,-20345,7769,-23874,0,
  -18329,-13471,-8445,-26033,-1060,-31130,-1043,-26048,-8400,-13488,-18277,0,-23833,7799,
  -20326,7010,-7987,39,7989,-6944,20347,-7765,23879,0,18337,13469,8452,26031,1063,31130,
  1040,26050,8394,13491,18269,0,23828,-7803,20323,-7018,7986,-49,-7990,6936,-20350,7761,
  -23885,0,-18344,-13466,-8458,-26029,-1065,-31130,-1038,-26053,-8388,-13493,-18262,0,
  -23822,7807,-20321,7026,-7986,59,7990,-6928,20353,-7756,23891,0,18352,13464,8464,26026,
  1068,31130,1035,26055,8381,13496,18254,0,23816,-7811,20318,-7034,7986,-68,-7990,6920,
  -20355,7752,-23897,0,-18359,-13462,-8471,-26024,-1070,-31130,-1033,-26057,-8375,-13498,
  -18247,0,-23810,7816,-20315,7042,-7985,78,7991,-6911,20358,-7748,23902,0,18367,13459,
  8477,26022,1073,31129,1030,26059,8368,13501,18239,0,23805,-7820,20313,-7050,7985,-88,
  -7991,6903,-20360};


/* Private typedef -----------------------------------------------------------*/
/* External variables --------------------------------------------------------*/
const K_ModuleItem_Typedef ModuleMath =
{
  MODULE_MATH,
  _MathConfig,
  _MathDemoExec,
  _MathExit,
  NULL
};

/**
  * @brief  setup the HW for Math application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _MathConfig(void)
{
  /* CORDIC Configuration */
  CordicHandle.Instance = CORDIC;
  if (HAL_CORDIC_Init(&CordicHandle) != HAL_OK)
  {
    Error_Handler();
  }

