STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/math/app_math.c
  /* FMAC Configuration */
  FmacHandle.Instance = FMAC;
  if (HAL_FMAC_Init(&FmacHandle) != HAL_OK)
  {
    Error_Handler();
  }

  return KMODULE_OK;
}

/**
  * @brief  Run the applications
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _MathDemoExec(void)
{
  /* App initialization    */
  kMenu_Execute(MathMenu);
  return KMODULE_OK;
}


/**
  * @brief  Exit from the application
  * @param  None.
  * @retval KMODULE_RETURN status.
  */
KMODULE_RETURN _MathExit(void)
{
  /* CORDIC DeInitialisation */
  HAL_CORDIC_DeInit(&CordicHandle);

  /* FMAC DeInitialisation */
  HAL_FMAC_DeInit(&FmacHandle);

  return KMODULE_OK;
}


/**
  * @brief  Get User action
  * @param  sel User selection (JOY_SEL,...)
  * @note   This is the only way to get user information.
  * @retval None
  */
void MathMenuUserAction(uint8_t sel)
{
  if (UserAction == 0)
  {
    UserAction = 1;
    UserEvent = sel;
  }
}


/**
  * @brief  Manage the CORDIC function selection
  * @param  None
  * @retval None
  */
static void Math_CORDIC(void)
{
  uint8_t sel = 1;
  uint8_t application_state = CORDIC_INIT;

  do
  {
    switch(application_state)
    {
    case CORDIC_INIT :
      Math_DisplayTitle("CORDIC");
      Math_DisplayBottomMessage(MSG_TITLE_SELECTION);
      Math_DisplayWindow();

    case CORDIC_SELECT_FUNCTION :
      Cordic_DisplayList(sel);
      Cordic_DisplayFunction(sel);
      application_state = CORDIC_WAIT_EVENT;

    case CORDIC_WAIT_EVENT :
      /* User action init */
      UserEvent = JOY_NONE;
      UserAction = 0;
      while(UserEvent == JOY_NONE);

      /* treatment of the user request */
      switch(UserEvent)
      {
      case JOY_DOWN:
        if (sel == CORDIC_MAX_FUNCTIONS)
        {
          sel = 1;
        }
        else
        {
          sel ++;
        }
        application_state = CORDIC_SELECT_FUNCTION;
        break;

      case JOY_UP:
        if (sel == 1)
        {
          sel = CORDIC_MAX_FUNCTIONS;
        }
        else
        {
          sel --;
        }
        application_state = CORDIC_SELECT_FUNCTION;
        break;

      case JOY_SEL:
      case JOY_LEFT:
        /* don't care */
        break;

      case JOY_RIGHT:
        application_state = CORDIC_EXIT;
        break;
      }

      /* Reset the UserEvent */
      UserEvent = JOY_NONE;
      UserAction = 0;
      break;

    case CORDIC_EXIT :
      application_state = CORDIC_END;
      break;
    }
  } while(application_state != CORDIC_END);
}

/**
  * @brief  Manage the FMAC function selection
  * @param  None
  * @retval None
  */
static void Math_FMAC(void)
{
  uint8_t sel = 1;
  uint8_t application_state = FMAC_INIT;

  do
  {
    switch(application_state)
    {
    case FMAC_INIT :
      Math_DisplayTitle("FMAC");
      Math_DisplayBottomMessage(MSG_TITLE_SELECTION);
      Math_DisplayWindow();

    case FMAC_SELECT_FUNCTION :
      Fmac_DisplayList(sel);
      Fmac_DisplayFunction(sel);
      application_state = FMAC_WAIT_EVENT;

    case FMAC_WAIT_EVENT :
      /* User action init */
      UserEvent = JOY_NONE;
      UserAction = 0;
      while(UserEvent == JOY_NONE);

      /* treatment of the user request */
      switch(UserEvent)
      {
      case JOY_DOWN:
        if (sel == FMAC_MAX_FUNCTIONS)
        {
          sel = 1;
        }
        else
        {
          sel ++;
        }
        application_state = FMAC_SELECT_FUNCTION;
        break;

      case JOY_UP:
        if (sel == 1)
        {
          sel = FMAC_MAX_FUNCTIONS;
        }
        else
        {
          sel --;
        }
        application_state = FMAC_SELECT_FUNCTION;
        break;

      case JOY_SEL:
      case JOY_LEFT:
        /* don't care */
        break;

      case JOY_RIGHT:
        application_state = FMAC_EXIT;
        break;
      }

      /* Reset the UserEvent */
      UserEvent = JOY_NONE;
      UserAction = 0;
      break;

    case FMAC_EXIT :
      application_state = FMAC_END;
      break;
    }
  } while(application_state != FMAC_END);
}

/**
  * @brief  Displays the title
  * @param  Title Characters string to display
  * @retval None
  */
static void Math_DisplayTitle(char * Title)
{
  uint32_t XSize;

  /* Clear screen */
  GUI_Clear(GUI_COLOR_WHITE);

  /* Display Title */
  GUI_SetBackColor(GUI_COLOR_ST_PINK);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  BSP_LCD_GetXSize(LCD_INSTANCE, &XSize);
  GUI_FillRect(0, LINE(0), XSize, Font24.Height, GUI_COLOR_ST_PINK);
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_DisplayStringAt(0, LINE(0), (uint8_t *)Title, CENTER_MODE);
}

/**
  * @brief  Displays the window for signal representation
  * @param  None
  * @retval None
  */
static void Math_DisplayWindow(void)
{
  uint32_t x, y;
  uint32_t XSize, YSize;
  uint32_t window_XSize, window_YSize;

  /* Get LCD size */
  BSP_LCD_GetXSize(0, (uint32_t *) &XSize);
  BSP_LCD_GetYSize(0, (uint32_t *) &YSize);

  /* Set graph window size */
  window_XSize = (XSize / 2) + 6;
  window_YSize = (YSize / 2) + 10;

  /* Set box initial coordonate */
  x = 0;
  y = (YSize / 4) - 5;

  /* Display Window border */
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_FillRect(x, y, window_XSize, window_YSize, GUI_COLOR_ST_BLUE);

  /* Clear box */
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_FillRect(x + 3, y + 3, window_XSize - 6, window_YSize - 6, GUI_COLOR_WHITE);
}

/**
  * @brief  Clear the window for signal representation
  * @param  None
  * @retval None
  */
static void Math_ClearWindow(void)
{
  uint32_t x, y;
  uint32_t XSize, YSize;
  uint32_t window_XSize, window_YSize;

  /* Get LCD size */
  BSP_LCD_GetXSize(0, (uint32_t *) &XSize);
  BSP_LCD_GetYSize(0, (uint32_t *) &YSize);

  /* Set graph window size */
  window_XSize = (XSize / 2) + 6;
  window_YSize = (YSize / 2) + 10;

  /* Set box initial coordonate */
  x = 0;
  y = (YSize / 4) - 5;

  /* Clear box */
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_FillRect(x + 3, y + 3, window_XSize - 6, window_YSize - 6, GUI_COLOR_WHITE);
}

/**
  * @brief  Displays the message at the bottom of the screen
  * @param  msg characters string to display
  * @retval None
  */
static void Math_DisplayBottomMessage(char * msg)
{
  uint32_t XSize;

