STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/math/app_math.c
  BSP_LCD_GetXSize(LCD_INSTANCE, &XSize);
  GUI_SetFont(&Font12);
  GUI_SetBackColor(GUI_COLOR_ST_BLUE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_FillRect(0, LINE(19), XSize, Font20.Height, GUI_COLOR_ST_BLUE);
  GUI_SetTextColor(GUI_COLOR_WHITE);
  GUI_DisplayStringAt(0, LINE(19), (uint8_t *)msg, CENTER_MODE);
  GUI_SetFont(&Font24);
}

/**
  * @brief  Displays the Cordic function list
  * @param  Select actual selection
  * @retval None
  */
static void Cordic_DisplayList(uint8_t Select)
{
  uint8_t i;

  GUI_SetFont(&Font12);
  GUI_DrawRect(170 - 3, 40 - 3 , 6 + CORDIC_MAX_FUNCTION_NAME_LENGHT*Font12.Width, 6 + CORDIC_MAX_FUNCTIONS*Font12.Height, GUI_COLOR_ST_GREEN_DARK);

  for (i = 0; i < CORDIC_MAX_FUNCTIONS; i++)
  {
    if (i == (Select - 1))
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }
    else
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE);
    }

    GUI_DisplayStringAt(170, 40 + Font12.Height*i, (uint8_t *)CordicFunctionList[i], LEFT_MODE);
  }

  GUI_SetFont(&Font24);
}

/**
  * @brief  Displays the Fmac function list
  * @param  Select actual selection
  * @retval None
  */
static void Fmac_DisplayList(uint8_t Select)
{
  uint8_t i;

  GUI_SetFont(&Font16);
  GUI_DrawRect(170 - 3, 40 -3 , 6 + FMAC_MAX_FUNCTION_NAME_LENGHT*Font16.Width, 6 + FMAC_MAX_FUNCTIONS*Font16.Height, GUI_COLOR_ST_GREEN_DARK);

  for (i = 0; i < FMAC_MAX_FUNCTIONS; i++)
  {
    if (i == (Select - 1))
    {
      GUI_SetBackColor(GUI_COLOR_ST_PINK);
      GUI_SetTextColor(GUI_COLOR_WHITE);
    }
    else
    {
      GUI_SetBackColor(GUI_COLOR_WHITE);
      GUI_SetTextColor(GUI_COLOR_ST_BLUE);
    }

    GUI_DisplayStringAt(170, 40 + Font16.Height*i, (uint8_t *)FmacFunctionList[i], LEFT_MODE);
  }

  GUI_SetFont(&Font24);
}

/**
  * @brief  Display the math function
  * @param  Select actual selection
  * @retval None
  */
static void Cordic_DisplayFunction(uint8_t Select)
{
  CORDIC_ConfigTypeDef sConfig;

  uint64_t TimeStart, TimeEnd;
  uint32_t TimePeriph, TimeSWLib;
  uint32_t index;

  int32_t InputBuffer[CORDIC_BLOCKSIZE];
  int32_t OutputBuffer[CORDIC_BLOCKSIZE*2] = {0};
  int32_t OutputBuffer2[CORDIC_BLOCKSIZE] = {0};

  int32_t *ptrIn = InputBuffer;
  int32_t *ptrOut = OutputBuffer;

  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
  case 2 : /* SIN + COS (DMA) */
    /* Prepare input buffer for CORDIC, range [0..2pi] */
    for (uint32_t index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = (2 * index * (0x80000000U / CORDIC_BLOCKSIZE));
    }

    /* Prepare CORDIC configuration */
    sConfig.Function         = CORDIC_FUNCTION_SINE;
    sConfig.Precision        = CORDIC_PRECISION_6CYCLES;
    sConfig.Scale            = CORDIC_SCALE_0;
    sConfig.NbWrite          = CORDIC_NBWRITE_1;
    sConfig.NbRead           = CORDIC_NBREAD_2;
    sConfig.InSize           = CORDIC_INSIZE_32BITS;
    sConfig.OutSize          = CORDIC_OUTSIZE_32BITS;

    break;

  case 3 : /* SQRT (Polling) */
    /* Prepare input buffer for CORDIC, range [0,027..0,75] */
    for (uint32_t index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = 0x0374BC6AU + (index*((0x5FFFFFFFU - 0x0374BC6AU) / CORDIC_BLOCKSIZE));
    }

    /* Prepare CORDIC configuration */
    sConfig.Function         = CORDIC_FUNCTION_SQUAREROOT;
    sConfig.Precision        = CORDIC_PRECISION_3CYCLES;
    sConfig.Scale            = CORDIC_SCALE_0;
    sConfig.NbWrite          = CORDIC_NBWRITE_1;
    sConfig.NbRead           = CORDIC_NBREAD_1;
    sConfig.InSize           = CORDIC_INSIZE_32BITS;
    sConfig.OutSize          = CORDIC_OUTSIZE_32BITS;

    break;
  }

  /* Configure the CORDIC peripheral */
  if (HAL_CORDIC_Configure(&CordicHandle, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /* Get TimeStart */
  TimeStart = (((uint64_t)SystemCoreClock / 1000U) * (HAL_GetTick() + 1)) - SysTick->VAL;

  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
    /* Start CORDIC calculation in Polling Mode */
    LL_CORDIC_WriteData(CORDIC, *ptrIn++);
    for (index = (CORDIC_BLOCKSIZE-1); index > 0; index--)
    {
      LL_CORDIC_WriteData(CORDIC, *ptrIn++);
      *ptrOut++ = LL_CORDIC_ReadData(CORDIC); /* SIN */
      *ptrOut++ = LL_CORDIC_ReadData(CORDIC); /* COS */
    }
    *ptrOut++ = LL_CORDIC_ReadData(CORDIC);   /* SIN */
    *ptrOut++ = LL_CORDIC_ReadData(CORDIC);   /* COS */

    break;

  case 2 : /* SIN + COS (DMA) */
    /* Start CORDIC calculation in DMA Mode */
    if (HAL_CORDIC_Calculate_DMA(&CordicHandle, InputBuffer, OutputBuffer,
                                 CORDIC_BLOCKSIZE, CORDIC_DMA_DIR_IN_OUT) != HAL_OK)
    {
      Error_Handler();
    }

    /* Wait CORDIC calculation completion */
    while (HAL_CORDIC_GetState(&CordicHandle) != HAL_CORDIC_STATE_READY) {}

    break;

  case 3 : /* SQRT (Polling) */
    /* Start CORDIC calculation in Polling Mode */
    LL_CORDIC_WriteData(CORDIC, *ptrIn++);
    for (index = (CORDIC_BLOCKSIZE-1); index > 0; index--)
    {
      LL_CORDIC_WriteData(CORDIC, *ptrIn++);
      *ptrOut++ = LL_CORDIC_ReadData(CORDIC); /* SQRT */
    }
    *ptrOut++ = LL_CORDIC_ReadData(CORDIC);   /* SQRT */

    break;
  }

  /* Measure computation time */
  TimeEnd = (((uint64_t)SystemCoreClock / 1000U)*(HAL_GetTick() + 1)) - SysTick->VAL;
  TimePeriph = TimeEnd - TimeStart;

  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
  case 2 : /* SIN + COS (DMA) */
    /* Reorder output buffers : SIN in OutputBuffer, COS in OutputBuffer2 */
    for (uint32_t index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
      OutputBuffer[index] = OutputBuffer[index*2];
      OutputBuffer2[index] = OutputBuffer[(index*2) + 1];
    }
    break;
  case 3 : /* SQRT (Polling) */
    break;
  }

  /* Clear Window */
  Math_ClearWindow();

  /* Display computed Signal */
  Math_DisplaySignal32b(OutputBuffer, CORDIC_BLOCKSIZE, GUI_COLOR_ST_PINK);

  /* Display second computed Signal if any */
  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
  case 2 : /* SIN + COS (DMA) */
    Math_DisplaySignal32b(OutputBuffer2, CORDIC_BLOCKSIZE, GUI_COLOR_ST_PURPLE);
  break;
  case 3 : /* SQRT (Polling) */
    break;
  }

  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
  case 2 : /* SIN + COS (DMA) */
    /* Prepare input buffer for arm fast math lib, range [0..2pi] */
    for (index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = (index*(0x80000000U / CORDIC_BLOCKSIZE));
    }
    break;

  case 3 : /* SQRT (Polling) */
    /* Prepare input buffer for arm fast math lib, range [0,027..0,75] */
    for (uint32_t index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = 0x0374BC6AU + (index*((0x5FFFFFFFU - 0x0374BC6AU) / CORDIC_BLOCKSIZE));
    }
    break;
  }

  /* Get TimeStart */
  TimeStart = (((uint64_t)SystemCoreClock / 1000U)*(HAL_GetTick() + 1)) - SysTick->VAL;

  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
  case 2 : /* SIN + COS (DMA) */
    /* Perform arm fast math lib calculation */
    for (index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
       OutputBuffer[index] = arm_sin_q31(InputBuffer[index]);
       OutputBuffer2[index] = arm_cos_q31(InputBuffer[index]);
    }
    break;

  case 3 : /* SQRT (Polling) */
    /* Perform arm fast math lib calculation */
    for (index = 0; index < CORDIC_BLOCKSIZE; index++)
    {
       arm_sqrt_q31(InputBuffer[index], &OutputBuffer[index]);
    }
    break;
  }

  /* Measure computation time */
  TimeEnd = (((uint64_t)SystemCoreClock / 1000U)*(HAL_GetTick() + 1)) - SysTick->VAL;
  TimeSWLib = TimeEnd - TimeStart;

  /* Display infos */
  switch (Select)
  {
  case 1 : /* SIN + COS (Polling) */
    Cordic_DisplayInfo("arm_math.h", TimePeriph, TimeSWLib, MATH_DISPLAY_CYCLES);
    break;

  case 2 : /* SIN + COS (DMA) */
    Cordic_DisplayInfo("arm_math.h", TimePeriph, TimeSWLib, (MATH_DISPLAY_CYCLES | MATH_DISPLAY_CPULOAD));
    break;

  case 3 : /* SQRT (Polling) */
    Cordic_DisplayInfo("arm_math.h", TimePeriph, TimeSWLib, MATH_DISPLAY_CYCLES);
    break;
  }
}

/**
  * @brief  Display the math function
  * @param  Select actual selection
  * @retval None
  */
static void Fmac_DisplayFunction(uint8_t Select)
{
  FMAC_FilterConfigTypeDef sConfig;

