STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/math/app_math.c
  uint64_t TimeStart, TimeEnd;
  uint32_t TimeSWLib;
  uint64_t CpuLoadSWLib;
  uint32_t index;

  int16_t  InputBuffer[FMAC_BLOCKSIZE];
  int16_t  OutputBuffer[FMAC_BLOCKSIZE] = {0};

  uint16_t FmacOutputDataSize;
  uint16_t FmacInputDataSize;

  arm_fir_instance_q15 fir_S;
  arm_biquad_casd_df1_inst_q15 iir_S;

  q15_t State[FMAC_STATE_SIZE] = {0};

  /* Null vector to preload FMAC internal output buffer (OutputBufferSize)*/
  int16_t null_vector[16] = {0};

  /* Reset Fmac notification */
  FmacOutputDataReady = 0;

  switch (Select)
  {
  case 1 : /* FIR 51 */
    /* Prepare Input Buffer: samples must not be scaled before injecting
       in FMAC, as gain (R) is 0 */
    for (index = 0; index < FMAC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = SIN_1_21KHZ[index];
    }

    /* Prepare FMAC configuration */
    sConfig.InputBaseAddress    = 0;
    sConfig.InputBufferSize     = 0x40;
    sConfig.InputThreshold      = FMAC_THRESHOLD_1;
    sConfig.InputAccess         = FMAC_BUFFER_ACCESS_DMA;
    sConfig.CoeffBaseAddress    = 0x40;
    sConfig.CoeffBufferSize     = 51;
    sConfig.CoeffBSize          = 51;
    sConfig.CoeffASize          = 0;
    sConfig.Filter              = FMAC_FUNC_CONVO_FIR;
    sConfig.OutputAccess        = FMAC_BUFFER_ACCESS_DMA;
    sConfig.OutputBaseAddress   = 0x80;
    sConfig.OutputBufferSize    = 16;
    sConfig.OutputThreshold     = 1;
    sConfig.P                   = 51;
    sConfig.Q                   = 0;
    sConfig.R                   = 0;
    sConfig.Clip                = FMAC_CLIP_ENABLED;
    sConfig.pCoeffB             = (int16_t*)fir51_Coeffs;
    sConfig.pCoeffA             = NULL;
    break;

  case 2 : /* IIR 8 */
    /* Prepare Input Buffer: samples must be right shifted by 2 before injecting
       in FMAC, as gain (R) is 2 (to avoid saturation) */
    for (index = 0; index < FMAC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = SIN_1_21KHZ[index] >> 2;
    }

    /* Prepare FMAC configuration */
    sConfig.InputBaseAddress    = 0;
    sConfig.InputBufferSize     = 0x40;
    sConfig.InputThreshold      = FMAC_THRESHOLD_1;
    sConfig.InputAccess         = FMAC_BUFFER_ACCESS_DMA;
    sConfig.CoeffBaseAddress    = 0x40;
    sConfig.CoeffBufferSize     = 17;
    sConfig.CoeffBSize          = 9;
    sConfig.CoeffASize          = 8;
    sConfig.Filter              = FMAC_FUNC_IIR_DIRECT_FORM_1;
    sConfig.OutputAccess        = FMAC_BUFFER_ACCESS_DMA;
    sConfig.OutputBaseAddress   = 0x80;
    sConfig.OutputBufferSize    = 16;
    sConfig.OutputThreshold     = 1;
    sConfig.P                   = 9;
    sConfig.Q                   = 8;
    sConfig.R                   = 2;
    sConfig.Clip                = FMAC_CLIP_ENABLED;
    sConfig.pCoeffB             = (int16_t*)iir8_Coeffs;
    sConfig.pCoeffA             = (int16_t*)iir8_Coeffs + 9;
    break;
  }

  /* Configure FMAC peripheral */
  if (HAL_FMAC_FilterConfig(&FmacHandle,&sConfig) != HAL_OK)
  {
    Error_Handler();
  }

  /* Perform FMAC calculation */
  if (HAL_FMAC_FilterPreload(&FmacHandle, NULL, 0, (int16_t *)null_vector, sConfig.OutputBufferSize) != HAL_OK)
  {
    Error_Handler();
  }

  /* Start FMAC */
  FmacInputDataSize = FMAC_BLOCKSIZE;
  FmacOutputDataSize = FmacInputDataSize - sConfig.CoeffBSize + 1;
  if (HAL_FMAC_FilterStart(&FmacHandle, OutputBuffer, &FmacOutputDataSize) != HAL_OK)
  {
    Error_Handler();
  }

  /* Provide input data to FMAC */
  if (HAL_FMAC_AppendFilterData(&FmacHandle, InputBuffer, &FmacInputDataSize) != HAL_OK)
  {
    Error_Handler();
  }

  /* Wait FMAC calculation completion */
  while(FmacOutputDataReady == 0);

  /* Stop FMAC */
  if (HAL_FMAC_FilterStop(&FmacHandle) != HAL_OK)
  {
    Error_Handler();
  }

  /* Clear Window */
  Math_ClearWindow();

  /* Display graphic, discarding first 40 samples (due to filter settling) */
  Math_DisplaySignal16b((int16_t*)SIN_1_21KHZ + 40, 100, GUI_COLOR_ST_GRAY_LIGHT);
  Math_DisplaySignal16b(OutputBuffer + 40, 100, GUI_COLOR_ST_PINK);

  switch (Select)
  {
  case 1 : /* FIR 51 */
    /* Prepare Input Buffer for FIR: samples are not scaled */
    for (index = 0; index < FMAC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = SIN_1_21KHZ[index];
    }
    break;

  case 2 : /* IIR 8 */
    /* Prepare Input Buffer for biquad filter: samples must be right shifted by 3 to avoid saturation */
    for (index = 0; index < FMAC_BLOCKSIZE; index++)
    {
      InputBuffer[index] = SIN_1_21KHZ[index] >> 3;
    }
    break;
  }

  /* Get TimeStart */
  TimeStart = (((uint64_t)SystemCoreClock/1000U)*(HAL_GetTick() + 1)) - SysTick->VAL;

  switch (Select)
  {
  case 1 : /* FIR 51 */
    /* Initialize filter with arm math library */
    arm_fir_init_q15(&fir_S, FMAC_NUM_TAPS_FIR, (q15_t*)fir51_Coeffs, State, FMAC_BLOCKSIZE);

    /* Perform calculation with arm math library */
    arm_fir_q15(&fir_S, InputBuffer, OutputBuffer, FMAC_BLOCKSIZE);

    break;

  case 2 : /* IIR 8 */
    /* Initialize filter with arm math library */
    arm_biquad_cascade_df1_init_q15(&iir_S, FMAC_NUM_STAGES_BIQUAD, (q15_t*)biquad_Coeffs, State, 0);

    /* Perform calculation with arm math library */
    arm_biquad_cascade_df1_q15(&iir_S, InputBuffer, OutputBuffer, FMAC_BLOCKSIZE);

    break;
  }

  /* Measure computation time */
  TimeEnd = (((uint64_t)SystemCoreClock / 1000U)*(HAL_GetTick() + 1)) - SysTick->VAL;
  TimeSWLib = TimeEnd - TimeStart;

  /* Compute CPU load */
  CpuLoadSWLib = (uint64_t)100 * (uint64_t)(TimeSWLib / FMAC_BLOCKSIZE) * (uint64_t)FMAC_FREQ_SAMPLING / (uint64_t)SystemCoreClock;

  /* Display time */
  Fmac_DisplayInfo("arm_math.h", (uint32_t) CpuLoadSWLib);
}

/**
  * @brief  Displays the signal graphic
  * @param  Buffer     data array to display
  * @param  BufferSize number of data
  * @param  Color      color of the graphic plots
  * @retval None
  */
static void Math_DisplaySignal32b(int32_t *Buffer, uint32_t BufferSize, uint32_t Color)
{
  uint64_t x1, y1, x2, y2;
  uint32_t XSize, YSize;
  uint32_t window_XSize, window_YSize;
  uint32_t index;

  /* Get LCD size */
  BSP_LCD_GetXSize(0, &XSize);
  BSP_LCD_GetYSize(0, &YSize);

  /* Set graph window size */
  window_XSize = XSize / 2;
  window_YSize = YSize / 2;

  x1 = 3;
  y1 = (YSize / 2) - (((int64_t)Buffer[0] * window_YSize) / 0xFFFFFFFFU);

  for (index = 1; index < BufferSize; index++)
  {
    x2 = 3 + ((index * window_XSize/BufferSize));
    y2 = (YSize / 2) - (((int64_t)Buffer[index] * window_YSize) / 0xFFFFFFFFU); /* '-' because inverse coordinates */

    /* Draw line until (x2,y2) */
    GUI_DrawLine(x1, y1, x2, y2, Color);
    x1 = x2;
    y1 = y2;
  }
}

/**
  * @brief  Displays the signal graphic
  * @param  Buffer     data array to display
  * @param  BufferSize number of data
  * @param  Color      color of the graphic plots
  * @retval None
  */
static void Math_DisplaySignal16b(int16_t *Buffer, uint32_t BufferSize, uint32_t Color)
{
  int32_t x1, y1, x2, y2;
  int32_t XSize, YSize;
  int32_t window_XSize, window_YSize;
  int32_t index;

  /* Get LCD size */
  BSP_LCD_GetXSize(0, (uint32_t *) &XSize);
  BSP_LCD_GetYSize(0, (uint32_t *) &YSize);

  /* Set graph window size */
  window_XSize = XSize / 2;
  window_YSize = YSize / 2;

  x1 = 3;
  y1 = (YSize / 2) - (Buffer[0] * window_YSize / 0xFFFF);

  for (index = 1; index < BufferSize; index++)
  {
    x2 = 3 + ((index * window_XSize/BufferSize));
    y2 = (YSize / 2) - (Buffer[index] * window_YSize / 0xFFFF); /* '-' because inverse coordinates */

    /* Draw line until (x2,y2) */
    GUI_DrawLine(x1, y1, x2, y2, Color);
    x1 = x2;
    y1 = y2;
  }
}

/**
  * @brief  Displays the time performance of computation with Peripheral and SW Lib
  * @param  SWLibName    pointer to characters string of Sw lib name
  * @param  PeriphTime   time value in cycles, with peripheral
  * @param  SWLibTime    time value in cycles, with SW lib
  * @param  DisplayStyle Style of info display (cycles, cpu load, or both)
  * @retval None
  */
static void Cordic_DisplayInfo(char * SWLibName, uint32_t PeriphTime, uint32_t SWLibTime, uint32_t DisplayStyle)
{
  uint8_t StringToDisplay[100];
  uint8_t line = 6;

