STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/math/app_math.c
  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_WHITE);
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_DisplayStringAt(170, LINE(line++), "Time to compl.", LEFT_MODE);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  sprintf((char*)StringToDisplay,"%d cycles ", PeriphTime);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)StringToDisplay, LEFT_MODE);

  if ((DisplayStyle & MATH_DISPLAY_CPULOAD) != 0)
  {
    GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"0% cpu load", LEFT_MODE);
  }
  else
  {
    GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"             ", LEFT_MODE);
  }

  line++;
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)SWLibName, LEFT_MODE);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);

  sprintf((char*)StringToDisplay,"%d cycles ", SWLibTime);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)StringToDisplay, LEFT_MODE);

  if ((DisplayStyle & MATH_DISPLAY_CPULOAD) != 0)
  {
    GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"100% cpu load", LEFT_MODE);
  }
  else
  {
    GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"             ", LEFT_MODE);
  }

  line = 12;
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  sprintf((char*)StringToDisplay,"%d samples ", CORDIC_BLOCKSIZE);
  GUI_DisplayStringAt(20, LINE(line++), (uint8_t *)StringToDisplay, LEFT_MODE);
}

/**
  * @brief  Displays the time performance of computation with Peripheral and SW Lib
  * @param  SWLibName     pointer to characters string of Sw lib name
  * @param  SWLibCpuLoad  cpu load, with SW lib
  * @retval None
  */
static void Fmac_DisplayInfo(char * SWLibName, uint32_t SWLibCpuLoad)
{
  uint8_t StringToDisplay[100];
  uint8_t line = 6;

  GUI_SetFont(&Font16);
  GUI_SetBackColor(GUI_COLOR_WHITE);

  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"FMAC (DMA)", LEFT_MODE);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)"0% cpu load ", LEFT_MODE);

  line++;
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)SWLibName, LEFT_MODE);
  GUI_SetTextColor(GUI_COLOR_ST_PINK);
  sprintf((char*)StringToDisplay,"%d%% cpu load   ", SWLibCpuLoad);
  GUI_DisplayStringAt(170, LINE(line++), (uint8_t *)StringToDisplay, LEFT_MODE);

  line = 12;
  GUI_SetTextColor(GUI_COLOR_ST_BLUE);
  sprintf((char*)StringToDisplay,"%dKHz sampling", FMAC_FREQ_SAMPLING_KHZ);
  GUI_DisplayStringAt(2, LINE(line++), (uint8_t *)StringToDisplay, LEFT_MODE);
}

/**
  * @brief  FMAC Output Data process complete callback.
  * @param  FmacHandle DMA handle.
  * @retval None
  */
void HAL_FMAC_OutputDataReadyCallback(FMAC_HandleTypeDef *FmacHandle)
{
  FmacOutputDataReady ++;
}

/**
* @brief  CORDIC MSP Initialization
* @param  CordicHandle pointer to the CORDIC handle
* @retval None
*/
void HAL_CORDIC_MspInit(CORDIC_HandleTypeDef* CordicHandle)
{
  /* CORDIC Peripheral clock enable */
  __HAL_RCC_CORDIC_CLK_ENABLE();

  /* DMA1 and DMAMUX1 Peripherals clock enable */
  __HAL_RCC_DMAMUX1_CLK_ENABLE();
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA WRITE channel Init */
  DmaCordicWriteHandle.Instance                 = DMA1_Channel3;
  DmaCordicWriteHandle.Init.Request             = DMA_REQUEST_CORDIC_WRITE;
  DmaCordicWriteHandle.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  DmaCordicWriteHandle.Init.PeriphInc           = DMA_PINC_DISABLE;
  DmaCordicWriteHandle.Init.MemInc              = DMA_MINC_ENABLE;
  DmaCordicWriteHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  DmaCordicWriteHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  DmaCordicWriteHandle.Init.Mode                = DMA_NORMAL;
  DmaCordicWriteHandle.Init.Priority            = DMA_PRIORITY_LOW;
  HAL_DMA_Init(&DmaCordicWriteHandle);
  /* Link DMA handle to CORDIC */
  __HAL_LINKDMA(CordicHandle,hdmaIn,DmaCordicWriteHandle);

  /* DMA READ channel Init */
  DmaCordicReadHandle.Instance                  = DMA1_Channel4;
  DmaCordicReadHandle.Init.Request              = DMA_REQUEST_CORDIC_READ;
  DmaCordicReadHandle.Init.Direction            = DMA_PERIPH_TO_MEMORY;
  DmaCordicReadHandle.Init.PeriphInc            = DMA_PINC_DISABLE;
  DmaCordicReadHandle.Init.MemInc               = DMA_MINC_ENABLE;
  DmaCordicReadHandle.Init.PeriphDataAlignment  = DMA_PDATAALIGN_WORD;
  DmaCordicReadHandle.Init.MemDataAlignment     = DMA_MDATAALIGN_WORD;
  DmaCordicReadHandle.Init.Mode                 = DMA_NORMAL;
  DmaCordicReadHandle.Init.Priority             = DMA_PRIORITY_LOW;
  HAL_DMA_Init(&DmaCordicReadHandle);
  /* Link DMA handle to CORDIC */
  __HAL_LINKDMA(CordicHandle,hdmaOut,DmaCordicReadHandle);

  /* DMA interrupts Init */
  /* DMA1_Channel3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
  /* DMA1_Channel4_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
}

/**
* @brief  CORDIC MSP De-Initialization
* @param  CordicHandle pointer to the CORDIC handle
* @retval None
*/
void HAL_CORDIC_MspDeInit(CORDIC_HandleTypeDef* CordicHandle)
{
  /* CORDIC Peripheral clock disable */
  __HAL_RCC_CORDIC_CLK_DISABLE();

  /* Reset CORDIC peripheral */
  __HAL_RCC_CORDIC_FORCE_RESET();
  __HAL_RCC_CORDIC_RELEASE_RESET();

  /* CORDIC DMA DeInit */
  HAL_DMA_DeInit(CordicHandle->hdmaIn);
  HAL_DMA_DeInit(CordicHandle->hdmaOut);

  /* DMA interrupts DeInit */
  HAL_NVIC_DisableIRQ(DMA1_Channel3_IRQn);
  HAL_NVIC_DisableIRQ(DMA1_Channel4_IRQn);
}

/**
  * @brief  Initializes the FMAC BSP.
  * @param  FmacHandle pointer to the HAL FMAC handle
  * @retval None
  */
void HAL_FMAC_MspInit(FMAC_HandleTypeDef* FmacHandle)
{
  /* Enable FMAC clock */
  __HAL_RCC_FMAC_CLK_ENABLE();

  /* Configuration of DMAs */
  /* DMA clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();
  __HAL_RCC_DMAMUX1_CLK_ENABLE();

  /* Configure DMA handle init parameters */
  DmaFmacInHandle.Instance                     = DMA1_Channel5;
  DmaFmacInHandle.Init.Request                 = DMA_REQUEST_FMAC_WRITE;
  DmaFmacInHandle.Init.Direction               = DMA_MEMORY_TO_PERIPH;
  DmaFmacInHandle.Init.PeriphInc               = DMA_PINC_DISABLE;
  DmaFmacInHandle.Init.MemInc                  = DMA_MINC_ENABLE;
  DmaFmacInHandle.Init.PeriphDataAlignment     = DMA_PDATAALIGN_WORD;
  DmaFmacInHandle.Init.MemDataAlignment        = DMA_MDATAALIGN_HALFWORD;
  DmaFmacInHandle.Init.Mode                    = DMA_NORMAL;
  DmaFmacInHandle.Init.Priority                = DMA_PRIORITY_HIGH;
  HAL_DMA_Init(&DmaFmacInHandle);
  /* Link DMA handle to FMAC */
  __HAL_LINKDMA(FmacHandle, hdmaIn, DmaFmacInHandle);

  /* Configure DMA handle init parameters */
  DmaFmacOutHandle.Instance                     = DMA1_Channel6;
  DmaFmacOutHandle.Init.Request                 = DMA_REQUEST_FMAC_READ;
  DmaFmacOutHandle.Init.Direction               = DMA_PERIPH_TO_MEMORY;
  DmaFmacOutHandle.Init.PeriphInc               = DMA_PINC_DISABLE;
  DmaFmacOutHandle.Init.MemInc                  = DMA_MINC_ENABLE;
  DmaFmacOutHandle.Init.PeriphDataAlignment     = DMA_PDATAALIGN_WORD;
  DmaFmacOutHandle.Init.MemDataAlignment        = DMA_MDATAALIGN_HALFWORD;
  DmaFmacOutHandle.Init.Mode                    = DMA_NORMAL;
  DmaFmacOutHandle.Init.Priority                = DMA_PRIORITY_HIGH;
  HAL_DMA_Init(&DmaFmacOutHandle);
  /* Link DMA handle to FMAC */
  __HAL_LINKDMA(FmacHandle, hdmaOut, DmaFmacOutHandle);

  /* Configure DMA handle init parameters */
  DmaFmacPreloadHandle.Instance                 = DMA1_Channel7;
  DmaFmacPreloadHandle.Init.Request             = 0;
  DmaFmacPreloadHandle.Init.Direction           = DMA_MEMORY_TO_MEMORY;
  DmaFmacPreloadHandle.Init.PeriphInc           = DMA_PINC_ENABLE;
  DmaFmacPreloadHandle.Init.MemInc              = DMA_MINC_DISABLE;
  DmaFmacPreloadHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  DmaFmacPreloadHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
  DmaFmacPreloadHandle.Init.Mode                = DMA_NORMAL;
  DmaFmacPreloadHandle.Init.Priority            = DMA_PRIORITY_HIGH;
  HAL_DMA_Init(&DmaFmacPreloadHandle);
  /* Link DMA handle to FMAC */
  __HAL_LINKDMA(FmacHandle, hdmaPreload, DmaFmacPreloadHandle);

  /* Configure DMA interruptions to use FMAC with DMA In */
  HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, 0x00, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);

  /* Configure DMA interruptions to use FMAC with DMA Out */
  HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 0x00, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);

  /* Configure DMA interruptions to use FMAC with Memory to Memory */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 0x00, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
}

/**
  * @brief  De-Initializes the FMAC BSP.
  * @param  FmacHandle pointer to the HAL FMAC handle
  * @retval None
  */
void HAL_FMAC_MspDeInit(FMAC_HandleTypeDef* FmacHandle)
{
  /* Disable FMAC clock */
  __HAL_RCC_FMAC_CLK_DISABLE();

  /* Reset FMAC */
  __HAL_RCC_FMAC_FORCE_RESET();
  __HAL_RCC_FMAC_RELEASE_RESET();

  /* Deinitialization of DMAs */
  HAL_DMA_DeInit(FmacHandle->hdmaIn);
  HAL_DMA_DeInit(FmacHandle->hdmaOut);

  /* Deinitialization of interruptions */
  HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);
  HAL_NVIC_DisableIRQ(DMA1_Channel6_IRQn);
  HAL_NVIC_DisableIRQ(DMA1_Channel7_IRQn);
}


#undef __APP_MATH_C
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
